app/controllers/user_thing_lookups_controller.rb

SELECT "user_thing_lookups".* FROM "user_thing_lookups" WHERE "user_thing_lookups"."user_id" = 1
---
  def index
    @user_thing_lookups = UserThingLookup.where(user_id: current_user)